def bishop():

    # Константы
    x_0 = 0
    y_0 = 0
    all_fields = ["11", "12", "13", "14", "15", "16", "17", "18", "21", "22", "23", "24", "25", "26", "27", "28",
                  "31", "32", "33", "34", "35", "36", "37", "38", "41", "42", "43", "44", "45", "46", "47", "48", "51",
                  "52", "53", "54", "55", "56", "57", "58", "61", "62", "63", "64", "65", "66", "67", "68", "71", "72",
                  "73", "74", "75", "76", "77", "78", "81", "82", "83", "84", "85", "86", "87", "88"]
    acronym_1 = {"a": 1, "b": 2, "c": 3, "d": 4, "e": 5, "f": 6, "g": 7, "h": 8}
    acronym_2 = {1: "a", 2: "b", 3: "c", 4: "d", 5: "e", 6: "f", 7: "g", 8: "h"}

    # Шапка программы
    print("Программа \"Куда может сходить слон\". Программа выпишет все координаты, куда может пойти слон, находясь в "
          "определённой точке.")

    # Ввод начальных координат
    input_coords = input("Введите начальные координаты слона: ")

    # Проверка введённых координат на действительность
    input_coords_len = len(input_coords)
    if input_coords_len != 2:
        print(f"\nОШИБКА: Начальная координата должна содержать 2 символа, а не {input_coords_len}.")

    elif input_coords[0] not in ["a", "b", "c", "d", "e", "f", "g", "h"]:
        print(f"\nОШИБКА: Первый символ начальной координаты должен являться буквой от \"a\" до \"h\", а не "
              f"\"{input_coords[0]}\".")
        return

    elif input_coords[1] not in ["1", "2", "3", "4", "5", "6", "7", "8"]:
        print(f"\nОШИБКА: Второй символ начальной координаты должен являться цифрой от \"1\" до \"8\", "
              f"а не \"{input_coords[1]}\".")
        return

    # Перевод координат в цифры
    else:
        x_0 = acronym_1[input_coords[0]]
        y_0 = int(input_coords[1])
    print("\nСписок всех координат, куда может сходить слон: ", end="")

    # Расчёт возможных ходов
    for i in all_fields:
        x = int(i[0])
        y = int(i[1])
        if abs(x - x_0) == abs(y - y_0):
            answer = "{}{}".format(acronym_2[x], y)
            if answer != input_coords:
                print(answer, end="; ")


bishop()
